In [44]:
import pandas as pd
import numpy as np

b1 = pd.read_csv('basic1.csv')
b1.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [45]:
#f1이 0인 데이터
b1_0 = b1[b1['f2'] == 0]
b1_0.head()
b1_0.shape

(49, 8)

In [46]:
b1_0 = b1_0.sort_values('age',ascending = True)
b1_0.head()

      id  age city     f1  f2   f3    f4         f5
98  id99  1.0   경기   47.0   0  NaN  ESFJ  97.381034
0   id01  2.0   서울    NaN   0  NaN  ENFJ  91.297791
85  id86  2.0   경기    NaN   0  NaN  ESTP  29.269869
56  id57  3.0   대구  111.0   0  NaN  ISFJ  29.269869
90  id91  6.0   경기   72.0   0  NaN  INTP   9.796378

In [47]:
bb = b1_0.iloc[:20]
bb.shape
bb.head()

      id  age city     f1  f2   f3    f4         f5
98  id99  1.0   경기   47.0   0  NaN  ESFJ  97.381034
0   id01  2.0   서울    NaN   0  NaN  ENFJ  91.297791
85  id86  2.0   경기    NaN   0  NaN  ESTP  29.269869
56  id57  3.0   대구  111.0   0  NaN  ISFJ  29.269869
90  id91  6.0   경기   72.0   0  NaN  INTP   9.796378

In [48]:
#결측치를 채우기 전의 분산
b_var = bb['f1'].var()
b_var

351.7636363636363

In [49]:
#결측치를 최소값으로 채우기
bb['f1'] = bb['f1'].fillna(bb['f1'].min())
a_var = bb['f1'].var()

<ipython-input-49-4507903c7095>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bb['f1'] = bb['f1'].fillna(bb['f1'].min())

In [50]:
a_var

313.32631578947377

In [51]:
print(round(b_var-a_var,2))

38.44